// creating an array and passing the number, questions, options, and answers
let questions = [
    {
    numb: 1,
    question: "តើប្រទេសកម្ពុជាមានផ្ទៃដីចំនួនប៉ុន្មាន?",
    answer: "១៨១ ០៣៥ គីឡូម៉ែត្រការ៉េ",
    options: [
      "១៨១ ០៣២ គីឡូម៉ែត្រការ៉េ",
      "១៨១ ០៣១ គីឡូម៉ែត្រការ៉េ",
      "១៨១ ០៣៥ គីឡូម៉ែត្រការ៉េ",
      "១៨១ ០៣៦ គីឡូម៉ែត្រការ៉េ"
    ]
  },
    {
    numb: 2,
    question: "តើប្រទេសកម្ពុជាចូលជាសមាជិកអង្ការសហប្រជាជាតិនៅថ្ងៃ ខែ ឆ្នាំណា??",
    answer: "ថ្ងៃទី ១៤ ខែ ធ្នូ ឆ្នាំ ១៩៥៥",
    options: [
      "ថ្ងៃទី ១១ ខែ ធ្នូ ឆ្នាំ ១៩៥៧",
      "ថ្ងៃទី ១៤ ខែ ធ្នូ ឆ្នាំ ១៩៥៤",
      "ថ្ងៃទី ១៦ ខែ ធ្នូ ឆ្នាំ ១៩៥២",
      "ថ្ងៃទី ១៤ ខែ ធ្នូ ឆ្នាំ ១៩៥៥"
    ]
  },
    {
    numb: 3,
    question: "តើប្រទេសកម្ពុជាមានប្រាសាទសរុបចំនួនប៉ុន្មាន?",
    answer: "មានប្រាសាទសរុប ១០៨០ ប្រាសាទ។",
    options: [
      "មានប្រាសាទសរុប ១០៨០ ប្រាសាទ។",
      "មានប្រាសាទសរុប ១០៧៦ ប្រាសាទ។",
      "មានប្រាសាទសរុប ១០៨២ ប្រាសាទ។",
      "មានប្រាសាទសរុប ១០៧៩ ប្រាសាទ។"
    ]
  },
    {
    numb: 4,
    question: "តើបារាំងបានដាក់អាណានិគមលើខ្មែរជាផ្លូវការនៅថ្ងៃ ខែ ឆ្នាំណា?",
    answer: "ថ្ងៃទី ១១ ខែ សីហា ឆ្នាំ ១៨៦៣៕",
    options: [
      "ថ្ងៃទី ១៣ ខែ សីហា ឆ្នាំ ១៨៦២៕",
      "ថ្ងៃទី ១១ ខែ សីហា ឆ្នាំ ១៨៦៣៕",
      "ថ្ងៃទី ១២ ខែ សីហា ឆ្នាំ ១៨៦១៕",
      "ថ្ងៃទី ១៤ ខែ សីហា ឆ្នាំ ១៨៦៤៕"
    ]
  },
    {
    numb: 5,
    question: "តើមនុស្សដែលស្មោះតែងតែជួបបញ្ហាអ្វី?",
    answer: "តែងតែត្រូវគេបោក៕",
    options: [
      "មួយកេសផឹកតែឯង៕",
      "មានជិវិតបែប PinkPink",
      "តែងតែត្រូវគេបោក៕",
      "តែងតែញញឹមគ្រប់ពេល៕"
    ]
  },
  // you can uncomment the below codes and make duplicate as more as you want to add question
  // but remember you need to give the numb value serialize like 1,2,3,5,6,7,8,9.....

  //   {
  //   numb: 6,
  //   question: "Your Question is Here",
  //   answer: "Correct answer of the question is here",
  //   options: [
  //     "Option 1",
  //     "option 2",
  //     "option 3",
  //     "option 4"
  //   ]
  // },
];